/*
Navicat MySQL Data Transfer

Source Server         : coolbhu.cn
Source Server Version : 50718
Source Host           : coolbhu.cn:3306
Source Database       : basefind

Target Server Type    : MYSQL
Target Server Version : 50718
File Encoding         : 65001

Date: 2017-06-07 13:33:05
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for baby
-- ----------------------------
DROP TABLE IF EXISTS `baby`;
CREATE TABLE `baby` (
  `BabyId` char(20) NOT NULL,
  `BabyName` varchar(50) NOT NULL,
  `BabyClass` varchar(20) DEFAULT NULL,
  `BabyFindTime` datetime NOT NULL,
  `BabyLookLike` varchar(255) DEFAULT NULL,
  `BabyLong` double DEFAULT NULL,
  `BabyLat` double DEFAULT NULL,
  `BabyPassSecret` varchar(50) DEFAULT NULL,
  `BabySecretKey` varchar(50) DEFAULT NULL,
  `BabyUpdateTime` datetime NOT NULL,
  `BabyFindMark` int(11) DEFAULT NULL,
  `BabyMark` int(11) DEFAULT NULL,
  `BabySlead` int(11) DEFAULT NULL,
  `BabyFindPhone` varchar(11) NOT NULL,
  PRIMARY KEY (`BabyId`),
  UNIQUE KEY `BabyId` (`BabyId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of baby
-- ----------------------------
INSERT INTO `baby` VALUES ('20170603153722070711', '华为p9手机', '手机', '2017-06-03 02:37:22', 'baby.jpg', '126.564414', '43.925567', '入网id号码？', '126456789', '2017-06-03 02:37:22', '-1', '1', '1', '15982026693');
INSERT INTO `baby` VALUES ('20170603155257793595', '钱包', '钱包', '2017-06-03 02:52:58', 'baby.jpg', '126.561241', '43.923259', '还有多少现金？', '500', '2017-06-03 02:52:58', '-1', '1', '1', '13166957076');
INSERT INTO `baby` VALUES ('20170603181814431327', '女朋友', '人', '2017-06-03 05:18:14', 'baby.jpg', '104.085988', '30.660665', '女朋友叫啥？', '郭婷', '2017-06-03 05:18:14', '-1', '1', '1', '15982026693');
INSERT INTO `baby` VALUES ('20170603232129134918', '你的宝贝', '宝贝', '2017-06-03 10:21:29', 'baby.jpg', '104.042331', '30.671006', '今天几号？', '3', '2017-06-03 10:21:29', '-1', '1', '1', '1314');
INSERT INTO `baby` VALUES ('20170603232321321455', '芒果', '水果', '2017-06-03 10:23:21', 'baby.jpg', '104.043169', '30.669753', '什么颜色？', '黄色', '2017-06-03 10:23:21', '-1', '1', '1', '96926');
INSERT INTO `baby` VALUES ('20170603232436179256', '土豆', '蔬菜', '2017-06-03 10:24:36', 'baby.jpg', '104.042181', '30.670149', '什么颜色？', '黄色', '2017-06-03 10:24:36', '-1', '1', '1', '4842436438');
INSERT INTO `baby` VALUES ('20170603232728395776', '包包', '衣物', '2017-06-03 10:27:28', 'baby.jpg', '104.041803', '30.669632', '品牌？', '香莱尔', '2017-06-03 10:27:28', '-1', '1', '1', '9345364');
INSERT INTO `baby` VALUES ('20170603233355359603', '榴莲', '水果', '2017-06-03 10:33:55', 'baby.jpg', '104.08186', '30.655192', '什么颜色？', '黄色', '2017-06-03 10:33:55', '-1', '1', '1', '96926');
INSERT INTO `baby` VALUES ('20170603233440999953', '土豆', '蔬菜', '2017-06-03 10:34:41', 'baby.jpg', '104.080074', '30.660061', '什么颜色？', '黄色', '2017-06-03 10:34:41', '-1', '1', '1', '4842436438');
INSERT INTO `baby` VALUES ('20170603233840502853', '苹果', '水果', '2017-06-03 10:38:41', 'baby.jpg', '104.044083', '30.670663', '什么颜色？', '红色', '2017-06-03 10:38:41', '-1', '1', '1', '64333226');
INSERT INTO `baby` VALUES ('20170603234007613672', '香蕉', '水果', '2017-06-03 10:40:08', 'baby.jpg', '104.043204', '30.671434', '什么颜色？', '黄色', '2017-06-03 10:40:08', '-1', '1', '1', '96926944326');
INSERT INTO `baby` VALUES ('20170603234151986406', '橘子', '水果', '2017-06-03 10:41:52', 'baby.jpg', '104.044386', '30.671749', '什么颜色？', '黄色', '2017-06-03 10:41:52', '-1', '1', '1', '785839864');
INSERT INTO `baby` VALUES ('20170604085920474749', '牛哥的节操', '节操', '2017-06-03 19:59:20', 'baby.jpg', '126.5768', '43.929953', '牛哥姓名？', '牛明鑫', '2017-06-03 19:59:20', '-1', '1', '1', '13166957076');
INSERT INTO `baby` VALUES ('20170604104624292759', '鞋子', '衣物', '2017-06-03 21:46:24', 'baby.jpg', '126.568861', '43.92675', '多大号？', '42', '2017-06-03 21:46:24', '-1', '1', '1', '13166957076');
INSERT INTO `baby` VALUES ('20170604104703995019', '钥匙', '钥匙', '2017-06-03 21:47:04', 'baby.jpg', '126.571586', '43.923756', '多少把钥匙？', '12', '2017-06-03 21:47:04', '-1', '1', '1', '13166957076');
INSERT INTO `baby` VALUES ('20170604104732742818', '手机', '手机', '2017-06-03 21:47:33', 'baby.jpg', '126.568994', '43.924129', '什么牌子？', '魅族', '2017-06-03 21:47:33', '-1', '1', '1', '15982026693');
